results/results/raw/interregion/flannel-interregion-apachebench_200K_500_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.6 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.6
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      500
Time taken for tests:   30.350 seconds
Complete requests:      200000
Failed requests:        0
Total transferred:      170800000 bytes
HTML transferred:       122400000 bytes
Requests per second:    6589.83 [#/sec] (mean)
Time per request:       75.874 [ms] (mean)
Time per request:       0.152 [ms] (mean, across all concurrent requests)
Transfer rate:          5495.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       11   60 266.1     13   15434
Processing:    11   14   1.5     13      26
Waiting:       11   13   1.2     13      23
Total:         23   73 266.0     27   15448

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     28
  75%     29
  80%     29
  90%     32
  95%     34
  98%   1042
  99%   1053
 100%  15448 (longest request)