results/results/raw/interregion/kuberouter-interregion-apachebench_100K_250_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.5 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.5
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      250
Time taken for tests:   8.174 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      85400000 bytes
HTML transferred:       61200000 bytes
Requests per second:    12234.06 [#/sec] (mean)
Time per request:       20.435 [ms] (mean)
Time per request:       0.082 [ms] (mean, across all concurrent requests)
Transfer rate:          10203.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        9   10   0.9     10      34
Processing:     9   10   1.0     10      37
Waiting:        9   10   0.9     10      36
Total:         18   20   1.5     20      48

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     21
  75%     21
  80%     21
  90%     22
  95%     22
  98%     23
  99%     24
 100%     48 (longest request)